---
type: PointOnEdge
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# PointOnEdge

`Autodesk.Revit.DB.PointOnEdge` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetEdgeReference | — | `public Reference GetEdgeReference ()` |
| Method | SetEdgeReference | — | `public void SetEdgeReference ( Reference reference )` |
| Property | LocationOnCurve | — | `public PointLocationOnCurve LocationOnCurve { get ; }` |